Documents/УстановкаВознагражденийАгентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаВознагражденийАгентам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПроцентыВознагражденийАгентам_ЕИП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаВознагражденийАгентам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Очистить(Команда)
	Объект.Услуги.Очистить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоТипуНаСервере(ТипУслуги)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.омг_ТипУслуги = &омг_ТипУслуги
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Наименование";
	
	Запрос.УстановитьПараметр("омг_ТипУслуги", ТипУслуги);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.Услуги.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.Услуги.Добавить();
		НовСтр.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
АСИНХ Процедура ЗаполнитьПоТипу(Команда)
	ТипУслуги = ПредопределенноеЗначение("Справочник.омг_ТипыУслуг.ПустаяСсылка");
	Ответ = ЖДАТЬ ВвестиЗначениеАсинх(ТипУслуги, "Выберите тип услуги для заполнения", Тип("СправочникСсылка.омг_ТипыУслуг"));

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоТипуНаСервере(Ответ);
КонецПроцедуры

&НаКлиенте
АСИНХ Процедура УстановитьПроцентДляВсехСтрок(Команда)
	Процент = 0;
	Ответ = ЖДАТЬ ВвестиЧислоАсинх(Процент, "Введите процент", 4,2);

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого Стр Из Объект.Услуги Цикл
		Стр.Процент = Ответ;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
АСИНХ Процедура УстановитьПроцентДляПустыхСтрок(Команда)
	Процент = 0;
	Ответ = ЖДАТЬ ВвестиЧислоАсинх(Процент, "Введите процент", 4,2);

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого Стр Из Объект.Услуги Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Процент) Тогда
			Стр.Процент = Ответ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
АСИНХ Процедура УстановитьПроцентПоТипуУслуги(Команда)
	
	ТипУслуги = ПредопределенноеЗначение("Справочник.омг_ТипыУслуг.ПустаяСсылка");
	ТипУслуги = ЖДАТЬ ВвестиЗначениеАсинх(ТипУслуги, "Выберите тип услуги для установки процента", Тип("СправочникСсылка.омг_ТипыУслуг"));

	Если ТипУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Процент = 0;
	Процент = ЖДАТЬ ВвестиЧислоАсинх(Процент, "Введите процент", 4,2);

	Если Процент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьПроцентПоТипуУслугиНаСервере(Процент, ТипУслуги);
КонецПроцедуры

&НаСервере
Процедура УстановитьПроцентПоТипуУслугиНаСервере(Процент, ТипУслуги)
	
	Для Каждого Стр ИЗ Объект.Услуги Цикл
		Если Стр.номенклатура.омг_ТипУслуги = ТипУслуги Тогда
			Стр.Процент = Процент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Схема = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетНоменклатуры");
	АдресСхемыНоменклатуры = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	
	НастройкиОтбораНоменклатуры.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыНоменклатуры));
	НастройкиОтбораНоменклатуры.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНонменклатуруПоОтбору(АдресСхемы, НастройкиСКД)
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиСКД.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаНоменклатуры);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
		МассивНоменклатуры.Добавить(СтрокаТаблицы.Номенклатура);
	КонецЦикла;    
	
	Возврат МассивНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеЗаполненияНастроекОтбора(Настройки, ДопПараметры) Экспорт
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтбораНоменклатуры = Настройки;
	
	МассивНоменклатуры = ПолучитьНонменклатуруПоОтбору(АдресСхемыНоменклатуры, НастройкиОтбораНоменклатуры);
	
	Для Каждого Номенклатура Из МассивНоменклатуры Цикл
		СтрокаТаблицы = Объект.Услуги.Добавить();
		СтрокаТаблицы.Номенклатура = Номенклатура;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьПоОтбору(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеЗаполненияНастроекОтбора", ЭтаФорма);
	
	ОткрытьФорму("Документ.УстановкаВознагражденийАгентам.Форма.ОтборСКД", 
		Новый Структура("Настройки, АдресСхемыНоменклатуры", 
		НастройкиОтбораНоменклатуры, АдресСхемыНоменклатуры), ЭтаФорма, УникальныйИдентификатор,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
